{
  "name": "Long Abandoned Campsite",
  "slug": "Swamp/campsite",
  "description": "You're standing on a small hill that barely rises out of the surrounding putrid waters of the swamp. It's barren and rocky. Pools of standing water and an eternity of stinking muck stretch out in every direction.\nAt the center of the hill is a campsite that looks like it's been abandoned for a long time. You see the remains of a campfire and a tattered rag that was once a tent. {stick}\nThe swampy terrain makes travel difficult; You can only head east or west. To the north is a large, muddy lake.",
  "east": "loadRoom|Swamp/mammoth-skull",
  "west": "loadRoom|Swamp/statue",
  "features": [
    {
      "slug": "hill",
      "look": "It's barren and rocky. It only rises a couple feet from the reeking waters of the swamp."
    },
    {
      "slug": "water",
      "look": "There's definitely no way that's safe to drink."
    },
    {
      "slug": "muck",
      "altSlugs": [
        "mud"
      ],
      "look": "You're not looking forward to trudging through that again."
    },
    {
      "slug": "campfire",
      "look": "There's a circle of stones and the ground is slightly the color of ash. There are a couple of burnt sticks too. It's been a long time since this campsite's been used."
    },
    {
      "slug": "tent",
      "look": [
        "The tent is tattered and full of holes. The edges are frayed. It collapsed a long time ago and the swamp has slowly been rotting it away.",
        "Inside the tent you notice there's an old, waterlogged pack.",
        "setFlag|SAWPACK"
      ]
    },
    {
      "slug": "stick",
      "altSlugs": [
        "flagpole"
      ],
      "notice": [
        {
          "cmd": "ifFlag",
          "args": [
            "TOOKFABRIC",
            [
              "There's also a stick laying on the ground."
            ],
            [
              "There's also a stick that's been driven into the ground like a flagpole with a tattered and faded bit of red fabric tied near its top like a flag."
            ]
          ]
        }
      ],
      "look": [
        {
          "cmd": "ifFlag",
          "args": [
            "TOOKFABRIC",
            [
              "It's laying there on the ground where you left it."
            ],
            [
              "It's been driven into the rocky terrain like a flagpole. It's a little crooked but you're impressed that it's survived for so long. Tied to the top of the stick is a tattered and faded strip of red cloth."
            ]
          ]
        }
      ],
      "take": "It's way too long to try to carry around."
    },
    {
      "slug": "fabric",
      "notice": "There's a strip of faded red cloth tied to it like a flag.",
      "destroyedFlag": "TOOKFABRIC",
      "look": "It's a tattered and faded strip of red cloth.",
      "take": [
        "You grab hold of the stick and yank it back and forth until it's loose enough to uproot. You pull it down and untie the fabric from its end. You take the fabric.",
        "setFlag|TOOKFABRIC",
        "addItem|RED_FABRIC"
      ]
    },
    {
      "slug": "pack",
      "targetFlag": "SAWPACK",
      "look": [
        "The pack is mostly rotted away. You manage to get it open but there's nothing in it but mildew{notebook}. It's badly water damaged.",
        "setFlag|SAWNOTEBOOK"
      ],
      "take": "The pack is too far gone to be useful anymore. You decide to leave it behind."
    },
    {
      "slug": "notebook",
      "altSlugs": ["rhode's journal"],
      "notice": " and a waterlogged notebook",
      "targetFlag": "SAWNOTEBOOK",
      "destroyedFlag": "TOOKNOTEBOOK",
      "look": [
        "The cover says \"R_ODE'S JOUR__L\". It's badly water damaged. If you took it, you could look through it."
      ],
      "take": [
        "You take the notebook.",
        "setFlag|TOOKNOTEBOOK",
        "addItem|OPHELIAS_JOURNAL"
      ]
    }
  ]
}