{
  "name": "A Pool of Standing Water",
  "slug": "Swamp/standing-water",
  "description": "You've found a large pool of standing water. It would almost be more of a lake--that is, if it was any deeper than a couple feet. The water has a film of algae across its surface. Strange, white plants that look like large puffballs grow sparsely on the pool.\nYou can see giant mosquitoes the size of housecats buzzing around in the distance all over the swamp. Some hover nearby, waiting for you to stop paying attention. Occasionally, one draws near and you bat it away.\nThe terrain allows you to head north, south, and east. To the southwest is a fetid lake.",
  "west": "loadRoom|Swamp/dead-tree",
  "south": "loadRoom|Swamp/bubbling-muck",
  "_common": {
    "die_puffball": "gameOver|You wade out into the pool of standing water, plowing a small path through the algae. You swat yet another mosquito away as you reach the nearest puffball. You examine it for a moment before finally reaching down and gently grabbing it. The little spikes growing on its surface aren't sharp enough to harm you. They do, however, pierce the puffball itself, causing it to explode and send a cloud of white spores and dust into the air all around you. You cough violently as they make their way into your lungs.\nA few moments later, your coughing fit ends but... you can't quite remember what you were just doing. You look around stupefied by your surroundings. What are you doing out here? What's the cold, wet feeling in your legs? You look down and see murky water but your brain just can't seem to identify what it is. You see your own distorted reflection in the rot-infested waters and lock eyes with it. You have no idea what that thing is. You quickly forget your own name or even how to breathe.\nStanding in the pool of stagnant water paralyzed, you start to suffocate. A cloud of giant mosquitoes descends on you. As your lungs begin to burn, lusting for air, you start to feel cold, very cold. When you finally lose consciousness you don't even fall prone. For a while, at least, your remains stand out in the pool as a warning to any others that might chance by.\nIf only you had known the proper technique for handling puffballs..."
  },
  "features": [
    {
      "slug": "mosquito",
      "altSlugs": [
        "mosquitoes"
      ],
      "look": "They're pretty much the stuff of nightmares. They've got huge wings and legs attached to long cylindrical bodies. Their proboscises are long and thing, like oversized needles. You can see some in the distance that are fat with the blood of some unfortunate creature. As long as you're attentive, they shouldn't pose any threat."
    },
    {
      "slug": "puffball",
      "altSlugs": ["puffballs","plant","plants"],
      "look": "The puffballs are an off-white color like bone. They're about a foot in diameter. Their surfaces aren't smooth. Instead, it looks like they grow multitudinous little white spikes all over. Each has umbilical-like steam that is a bone-white color that snakes down beneath the muddy water.",
      "take": "callCommon|die_puffball",
      "touch": "callCommon|die_puffball"
    }
  ]
}