{
  "name": "Toppled Tree, Growing Mushrooms",
  "slug": "Swamp/toppled-log",
  "description": "You're standing in about 6 inches of stinking, putrid muck. It sucks at your shoes, making movement difficult. Stagnant, brackish water forms pools all over. An ancient toppled tree lays here, covered in mushrooms. \nThe terrain allows you to head north, south, and east. To the southeast is a large, rot-infested lake blocking the way.",
  "north": "loadRoom|Swamp/forest-entrance",
  "south": "loadRoom|Swamp/mosquito-spawn",
  "east": "loadRoom|Swamp/dead-tree",
  "load": [
    "setVarValue|SEQ|0"
  ],
  "incant": {
    "etavoner": [
      {
        "cmd": "ifFlag",
        "args": [
          "ALLGLOWING&SEECRACK&!CRACKREPAIRED",
          [
            "You incant the Charm of Repairing. The spasming crack of light immediately stops and holds its position.",
            "setFlag|CRACKREPAIRED"
          ],
          "You incant the Charm of Repairing but nothing happens."
        ]
      }
    ],
    "lievnu": [
      {
        "cmd": "ifFlag",
        "args": [
          "ALLGLOWING&!SEECRACK",
          [
            "You incant the Charm of Revealing. The faint glimmer in the air coalesces into a tiny point of light then suddenly a crack appears in the fabric of reality, just hanging there in the air.",
            "setFlag|SEECRACK"
          ],
          "You incant the Charm of Repairing but nothing happens."
        ]
      }
    ]
  },
  "_common": {
    "mushroom_gameover": [
      "gameOver|As soon as you touch the mushroom you feel a jolt of pain fire down your arm and into your chest. You drop to your knees in the muck. The pain still in your chest, you begin retching violently. At some point you realize that you're laying on your side in the stagnant water. You can't seem to move your body. It's raining and you feel like you're on fire.\nYou can hear the buzzing of giant mosquitos as they land on you. You can feel their needle-like proboscises pierce into your skin. You'd wince if you could. The monsters are so thirsty you can feel your blood being drained away.\nYou close your eyes... just for a moment... ..."
    ]
  },
  "features": [
    {
      "slug": "mosquito",
      "altSlugs": [
        "mosquitoes"
      ],
      "roomDesc": "callCommon|mosquito_blurb|global-common",
      "look": "callCommon|mosquito_look|global-common"
    },
    {
      "slug": "mushroom",
      "altSlugs": [
        "mushrooms"
      ],
      "look": [
        "The mushrooms covering the log are of all shapes and sizes. Some you've seen pictures of before, maybe, somewhere. Others are completely alien to you.\nThere is a peculiar array of seven colorful mushrooms in a neat row. Each is 6 inches tall with a thick stalk and a rounded cap a foot in diameter. They all oddly appear to be the exact same size with only the color of their caps to differentiate them. From left to right they are green, yellow, indigo, red, purple, blue, and orange. They're like nothing you've ever seen.",
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            0,
            [
              {
                "cmd": "ifVar",
                "args": [
                  "SEQ",
                  ">=",
                  7,
                  [
                    "All the colored mushrooms are glowing brightly."
                  ],
                  [
                    "Some of the colored mushrooms are glowing brightly."
                  ]
                ]
              }
            ],
            null
          ]
        }
      ]
    },
    {
      "slug": "tree",
      "altSlugs": [
        "log"
      ],
      "look": "The branches have long since rotted away, leaving only a massive, rot-infested log. Moss, lichen and innumerable small mushrooms call this tree their home. An array of seven colorful mushrooms grow in a neat row."
    },
    {
      "slug": "green mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            5,
            [
              "It's glowing a bright green color."
            ],
            [
              "It's a bright green color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            5,
            [
              "incVar|SEQ",
              "You touch the green mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "yellow mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            6,
            [
              "It's glowing a bright yellow color."
            ],
            [
              "It's a bright yellow color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            6,
            [
              "incVar|SEQ",
              "You touch the yellow mushroom and it begins to glow. Now all of the colored mushrooms on the log are all glowing.",
              "A faint glimmer appears in the air nearby.",
              "setFlag|ALLGLOWING"
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "indigo mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            "0",
            [
              "It's glowing a bright indigo color."
            ],
            [
              "It's a bright indigo color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            1,
            [
              "incVar|SEQ",
              "You touch the indigo mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "red mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            2,
            [
              "It's glowing a bright red color."
            ],
            [
              "It's a bright red color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            2,
            [
              "incVar|SEQ",
              "You touch the red mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "purple mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            3,
            [
              "It's glowing a bright purple color."
            ],
            [
              "It's a bright purple color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            3,
            [
              "incVar|SEQ",
              "You touch the purple mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "blue mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            4,
            [
              "It's glowing a bright blue color."
            ],
            [
              "It's a bright blue color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            4,
            [
              "incVar|SEQ",
              "You touch the blue mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "orange mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            0,
            [
              "It's glowing a bright orange color."
            ],
            [
              "It's a bright orange color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            0,
            [
              "incVar|SEQ",
              "You touch the orange mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "lake",
      "look": "It's algae-coated with a black film over its surface. You can see a peninsula reaching out into it from the east shore. There's some sort of building on the peninsula."
    },
    {
      "slug": "glimmer",
      "destroyedFlag": "!ALLGLOWING|SEECRACK",
      "roomDesc": "There's a faint glimmer hanging in the air.",
      "look": "It's a small patch of faintly glimmering light just hanging in the air. Somehow, you feel that there's something more to it..."
    },
    {
      "slug": "crack",
      "roomDesc": [
        {
          "cmd": "ifFlag",
          "args": [
            "CRACKREPAIRED",
            "Hanging in the air next to the log and shifting around slightly, is a small crack. You can see a brilliant white light filtering out of it. You feel drawn to it, as though you should reach out and touch it.",
            [
              "Hanging in the air next to the log and shifting around slightly, is a small crack. You can see a brilliant white light filtering out of it. Occasionally, the crack seems to spasm in the air and reform in a different orientation. It doesn't seem very stable. You feel drawn to it, as though you could reach out and touch it."
            ]
          ]
        }
      ],
      "destroyedFlag": "!SEECRACK",
      "look": [
        {
          "cmd": "ifFlag",
          "args": [
            "CRACKREPAIRED",
            "It's just hanging in the air next to the log and shifting around slightly. You can see a brilliant white light filtering out of it. You feel drawn to it, as though you should reach out and touch it.",
            [
              "It's just hanging in the air next to the log and shifting around slightly. You can see a brilliant white light filtering out of it. Occasionally, the crack seems to spasm in the air and reform in a different orientation. It doesn't seem very stable. You feel drawn to it, as though you could reach out and touch it."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifFlag",
          "args": [
            "CRACKREPAIRED",
            [
              "You feel a tingling sensation as your hand passes through the crack. The crack widens and widens until you are blinded by white light. You begin to remember memories that aren't your own.",
              {
                "cmd": "waitForInput",
                "args": [
                  "loadRoom|Memories/merek"
                ]
              }
            ],
            [
              "You feel a tingling sensation as your hand passes through the crack. The crack widens and widens until you are blinded by white light. You begin to remember memories that aren't your own. Suddenly, the whole universe seems to spasm and shift into a different orientation.",
              {
                "cmd": "waitForInput",
                "args": [
                  "gameOver|U ded."
                ]
              }
            ]
          ]
        }
      ]
    }
  ]
}