{
  "name": "Toppled Tree, Growing Mushrooms",
  "slug": "Swamp/toppled-log",
  "description": "You're standing in about 6 inches of stinking, putrid muck. It sucks at your shoes, making movement difficult. Stagnant, brackish water forms pools all over. An ancient toppled tree lays here, covered in mushrooms. \nYou can see giant mosquitoes the size of housecats buzzing around in the distance all over the swamp. Some hover nearby, waiting for you to stop paying attention. Occasionally, one draws near and you bat it away.\nThe terrain allows you to head north, south, and east. To the southeast is a large, rot-infested lake.",
  "north": "loadRoom|Swamp/forest-entrance",
  "south": "loadRoom|Swamp/mosquito-spawn",
  "east": "loadRoom|Swamp/dead-tree",
  "load": [
    "setVarValue|SEQ|0"
  ],
  "_common": {
    "mushroom_gameover": [
      "gameOver|As soon as you touch the mushroom you feel a jolt of pain fire down your arm and into your chest. You drop to your knees in the muck. The pain still in your chest, you begin retching violently. At some point you realize that you're laying on your side in the stagnant water. You can't seem to move your body. It's raining and you feel like you're on fire.\nYou can hear the buzzing of giant mosquitos as they land on you. You can feel their needle-like proboscises pierce into your skin. You'd wince if you could. The monsters are so thirsty you can feel your blood being drained away.\nYou close your eyes... just for a moment... ..."
    ]
  },
  "features": [
    {
      "slug": "mosquito",
      "altSlugs": [
        "mosquitoes"
      ],
      "look": "They're pretty much the stuff of nightmares. They've got huge wings and legs attached to long cylindrical bodies. Their proboscises are long and thing, like oversized needles. You can see some in the distance that are fat with the blood of some unfortunate creature. As long as you're attentive, they shouldn't pose any threat."
    },
    {
      "slug": "mushroom",
      "altSlugs": [
        "mushrooms"
      ],
      "look": [
        "The mushrooms covering the log are of all shapes and sizes. Some you've seen pictures of before, maybe, somewhere. Others are completely alien to you.\nThere is a peculiar array of seven colorful mushrooms in a neat row. Each is 6 inches tall with a thick stalk and a rounded cap a foot in diameter. They all oddly appear to be the exact same size with only the color of their caps to differentiate them. From left to right they are green, yellow, indigo, red, purple, blue, and orange. They're like nothing you've ever seen.",
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            0,
            [
              {
                "cmd": "ifVar",
                "args": [
                  "SEQ",
                  ">=",
                  7,
                  ["All the colored mushrooms are glowing brightly."],
                  ["Some of the colored mushrooms are glowing brightly."]
                ]
              }
            ],
            null
          ]
        }
      ]
    },
    {
      "slug": "tree",
      "altSlugs": [
        "log"
      ],
      "look": "The branches have long since rotted away, leaving only a massive, rot-infested log. Moss, lichen and innumerable small mushrooms call this tree their home. An array of seven colorful mushrooms grow in a neat row."
    },
    {
      "slug": "green mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            5,
            [
              "It's glowing a bright green color."
            ],
            [
              "It's a bright green color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            5,
            [
              "incVar|SEQ",
              "You touch the green mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "yellow mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            6,
            [
              "It's glowing a bright yellow color."
            ],
            [
              "It's a bright yellow color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            6,
            [
              "incVar|SEQ",
              "You touch the yellow mushroom and it begins to glow.\nAll of the colored mushrooms on the log are all glowing.",
              "setFlag|ALLGLOWING"
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "indigo mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            "0",
            [
              "It's glowing a bright indigo color."
            ],
            [
              "It's a bright indigo color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            1,
            [
              "incVar|SEQ",
              "You touch the indigo mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "red mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            2,
            [
              "It's glowing a bright red color."
            ],
            [
              "It's a bright red color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            2,
            [
              "incVar|SEQ",
              "You touch the red mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "purple mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            3,
            [
              "It's glowing a bright purple color."
            ],
            [
              "It's a bright purple color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            3,
            [
              "incVar|SEQ",
              "You touch the purple mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "blue mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            4,
            [
              "It's glowing a bright blue color."
            ],
            [
              "It's a bright blue color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            4,
            [
              "incVar|SEQ",
              "You touch the blue mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    },
    {
      "slug": "orange mushroom",
      "look": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            ">",
            0,
            [
              "It's glowing a bright orange color."
            ],
            [
              "It's a bright orange color."
            ]
          ]
        }
      ],
      "touch": [
        {
          "cmd": "ifVar",
          "args": [
            "SEQ",
            "==",
            0,
            [
              "incVar|SEQ",
              "You touch the orange mushroom and it begins to glow."
            ],
            [
              "callCommon|mushroom_gameover"
            ]
          ]
        }
      ]
    }
  ]
}