{
  "name": "Ruined Square, South",
  "slug": "Ruins/ruined-square-south",
  "description": "You stand in the midst of a city in ruins. All around you are ruined buildings made of gray stone and piles of rubble. To the west is a ruined hall. To the south is a ruined home. To the east, a doorway leads inside to another ruined building. A path leads through the rubble to the north.",
  "north": "loadRoom|Ruins/ruined-square-north",
  "south": [
    {
      "cmd": "ifFlag",
      "args": [
        "WALLDESTROYED",
        "loadRoom|Ruins/ruined-house",
        "The building to the south is sealed shut by a much newer brick wall. It's covered in fractures and looks pretty weak. You'll have to deal with that first."
      ]
    }
  ],
  "east": "loadRoom|Ruins/lab",
  "west": [
    {
      "cmd": "ifFlag",
      "args": [
        "G.RUINEDHALLOPEN",
        "loadRoom|Ruins/ruined-hall",
        "The way west is sealed by a heavy stone door."
      ]
    }
  ],
  "features": [
    {
      "slug": "door",
      "altSlugs": [
        "stone door",
        "west door"
      ],
      "look": "It's a heavy stone door blocking the way."
    },
    {
      "slug": "wall",
      "altSlugs": [
        "brick wall",
        "south wall",
        "south brick wall"
      ],
      "smash|destroy|break|kick|bash": "You're not strong enough to break it down with your bare hands.",
      "use": {
        "SLEDGE": [
          {
            "cmd": "ifFlag",
            "args": [
              "WALLDESTROYED",
              "It's already been broken open. You smash up a couple loose bricks to make yourself feel better.",
              [
                "You take the sledgehammer in hand and swing with all your might. You shatter a brick in the center of the wall, bowing the entire wall inward slightly. After another few strong strikes, the wall gives out and collapses into a heap of bricks. The way south is open.",
                "setFlag|WALLDESTROYED"
              ]
            ]
          }
        ]
      }
    },
    {
      "slug": "cairn",
      "roomDesc": "In the middle of the ruined square, small bits of rubble have been stacked, forming a cairn about 3 feet tall.",
      "look": "The cairn is made out of broken bits of the rubble itself, each piece inscribed with small runes.",
      "touch": "callCommon|cairn_touch|global-common"
    }
  ]
}