{
  "name": "Ruined Hall",
  "slug": "Ruins/ruined-hall",
  "description": "You stand in a dimly lit, very wide and long ruined hall. Light streams in through cracks in the walls and ceiling, which is very high above you. There is a solid stone altar at the far end, engraved with a runic symbol.\nThere is a doorway that leads outside to the west. {door} There is a metal device affixed to the wall next to the large stone door.",
  "west": "loadRoom|Forest/ruins-entrance",
  "east": [
    {
      "cmd": "ifFlag",
      "args": [
        "G.RUINEDHALLOPEN",
        "loadRoom|Ruins/ruined-square",
        "You can't go east. The large stone door is blocking your path. Maybe the device on the wall has something to do with it."
      ]
    }
  ],
  "features": [
    {
      "slug": "columns",
      "look": "The columns are cracked and crumbling in places but still sturdily hold up the hall."
    },
    {
      "slug": "altar",
      "look": "The altar is a large piece of white stone. Engraved on its surface is a large, runic symbol."
    },
    {
      "slug": "runic symbol",
      "altSlugs": [
        "rune",
        "symbol"
      ],
      "look": "ᛞ"
    },
    {
      "slug": "door",
      "altSlugs": [
        "stone door",
        "east door"
      ],
      "notice": [
        {
          "cmd": "ifFlag",
          "args": [
            "G.RUINEDHALLOPEN",
            "There is an open doowary that leads outside to the east.",
            "There is also a large stone door that leads to the east."
          ]
        }
      ],
      "look": [
        {
          "cmd": "ifFlag",
          "args": [
            "G.RUINEDHALLOPEN",
            "The door has slid out of the way, granting access eastward.",
            "The door is large and solid. It looks like it's made out of the same material as the altar."
          ]
        }
      ]
    },
    {
      "slug": "device",
      "altSlugs": [
        "metal device"
      ],
      "look": [
        {
          "cmd": "ifFlag",
          "args": [
            "G.RUINEDHALLOPEN",
            "It's a metal base affixed to the wall. It's rounded and looks like it pivots up and down. It's currently pointed upward.",
            "It's a metal base affixed to the wall. It's rounded and looks like it pivots up and down. It's currently pointed downward."
          ]
        },
        {
          "cmd": "ifFlag",
          "args": [
            "RODINSERTED",
            "There's a rusty metal rod sticking out of it. You could probably use the device now.",
            "There's a round opening in the front of it that is about an inch and a half in diameter."
          ]
        }
      ],
      "use": {
        "": [
          {
            "cmd": "ifFlag",
            "args": [
              "RODINSERTED",
              [
                {
                  "cmd": "ifFlag",
                  "args": [
                    "G.RUINEDHALLOPEN",
                    [
                      "You grip the rusty metal rod and pull the lever downward with all your might and it clunks into the place. A moment later there is a grinding sound as the large stone door to the east slides downward, sealing the passage.",
                      "unsetFlag|G.RUINEDHALLOPEN"
                    ],
                    [
                      "You grip the rusty metal rod and push the lever upward with all your might and it clunks into the place. A moment later there is a grinding sound as the large stone door to the east slides upward, unsealing the passage.",
                      "setFlag|G.RUINEDHALLOPEN"
                    ]
                  ]
                }
              ],
              "There's no way to use the device in its current state. It seems like there's something missing."
            ]
          }
        ],
        "RUINS_ROD": [
          "You slot the metal rod into the opening in the device. It fits perfectly!",
          "removeItem|RUINS_ROD",
          "setFlag|RODINSERTED"
        ]
      }
    },
    {
      "slug": "rod",
      "targetFlag": "RODINSERTED",
      "look": "It's a rusty metal rod sticking out of the device.",
      "take": [
        "You pull the metal rod out of the device and take it.",
        "addItem|RUINS_ROD",
        "unsetFlag|RODINSERTED"
      ]
    }
  ]
}