{
  "slug": "global-common",
  "_common": {
    "cairn_touch": [
      "You reach out and gingerly and respectfully touch the cairn. For just a moment you feel at peace--like everything is going to be OK. A new runic symbol slowly etches itself onto one of the stones.",
      "saveGame"
    ],
    "mosquito_blurb": "You can see giant mosquitoes the size of housecats buzzing around in the distance all over the swamp. Some hover nearby, waiting for you to stop paying attention. Occasionally, one draws near and you bat it away.",
    "mosquito_look": "They're pretty much the stuff of nightmares. They've got huge wings and legs attached to long cylindrical bodies. Their proboscises are long and thin, like oversized needles. You can see some in the distance that are fat with the blood of some unfortunate creature. As long as you're attentive, they shouldn't pose any threat.",
    "after_learn_incant": "You can recall the list of all incantations you have learned by typing \"incantations\".",
    "see_lighthouse_distant": "It's too far away to make out any details. You can tell that the light is on, though.",
    "see_beach": "It's beautiful, with white sand and with ocean waves crashing into it.",
    "see_ocean": "It's a sparkling blue ocean. It stretches off to the horizon.",
    "dunes_look": "The dunes make rolling hills of sand. It might actually be fun to play around here if, you know, you weren't in constant danger and in fear for your life all the time.",
    "hatch_note_look": [
      "The handwritten note reads:",
      "]Lowered into darkness, far and out of sight\\Plunged into clear waters, etavoner regains its might."
    ],
    "ophelias_journal1_look": [
      "The cover says \"__HELI_'S JOUR__L\". It's badly water damaged. You try to flip through the pages. Most are clumped together or completely destroyed. You do find a couple passages that are still legible:",
      "]_er__ _eft w_thou_ us in _he mid_le of the n____. We f_llow__ _fter _t dawn. It'_ be_n _eeks _n_ the_e's no sig_ of h__. It se_ms li_e _hen pe__le spl__ u_ here t_ey just... disa__ear. We ma_e a flagpo__ a__ us_d a str_p of hi_ fav__it_ clo_k as t__ fl_g. __ybe he'_l se_ it an_ ret__n.",
      "You find one other legible passage:",
      "]To travers_ ou_ ___or__s wh__e av__ding h___, touc_ o_r fav___te colo_s th_n i__a_t __e charm:\\Edr_\\Mine!\\Merek\\Rh_d_\\Ar_en\\M__edit_\\Sta_le_"
    ],
    "ophelias_journal2_look": [
      "The cover says \"OPHELIA'S JOURNAL\". It's badly water damaged. You try to flip through the pages. Most are clumped together or completely destroyed. You do find a couple passages that are still legible:",
      "]Merek left without us in the middle of the night. We followed after at dawn. It's been weeks and there's no sign of him. It seems like when people split up here they just... disappear. We made a flagpole and used a strip of his favorite cloak as the flag. Maybe he'll see it and return.",
      "You find one other legible passage:",
      "]To traverse our memories while avoiding harm, touch our favorite colors then incant the charm:\\Edra\\Mine!\\Merek\\Rhode\\Arden\\Meredith\\Stanley"
    ],
    "crumpled_note": [
      "It's a crumpled, handwritten note. You try to smooth it out and read it.",
      "]Stanley said to hide the box somewhere dark and out of the way. He told me to find a small chamber in the caves somewhere and stash it inside and that \"It\" would handle the rest. I did as I was told. I've ALWAYS done as I was told. I spent my whole life in service to the Order, hunting who they said to hunt. I believed in the cause. But they never said anything about \"It\". Whatever \"It\" is. Was the whole Order a lie? Was it all just a tool that \"It\" used throughout history to bring people here?",
      "]But I did what I was told and hid the box. So why am I being punished? I can feel \"It\" inside me, draining my memories. Soon there will be nothing left...",
      "] -Meredith"
    ],
    "broken_box_look": "It's a small silver box about 4 inches square and 2 inches deep. It's broken into two pieces. The hinges are completely destroyed and the top and bottom are separated. The outside of the box is very ornamental but the inside is empty and devoid of any filligree.",
    "open_activated_box": "TODO: open dat box, yo!",
    "folded_note": [
      "It's a note folded in half.",
      "]To the brothers whose names I've forgotten,",
      "]I'm sorry.",
      "]-Meredith"
    ],
    "maze_lost": [
      "You enter the maze and follow its twists and turns. You reach a dead end and turn around. The way back seems... different. You're not sure how but you've gotten completely turned around. Without a map to guide the way, you're hopelessly lost. You wander for what seems like hours.",
      {
        "cmd": "waitForInput",
        "args": [
          {
            "cmd": "pickOne",
            "args": [
              "loadRoom|Mountain/maze-south",
              "loadRoom|Mountain/maze-north",
              "loadRoom|Mountain/maze-center"
            ]
          }
        ]
      }
    ],
    "parchment_look": [
      "The parchment reads:",
      "To the fortress underground, where their queen has been crowned. To her highness present it, to unlock the truth of eltnamsid."
    ]
  }
}