{
  "name": "The Computer Room",
  "slug": "Tutorial/computer-room",
  "description": "You're in a large, brightly lit room. A single, uncomfortable looking metal chair sits before a huge computer console that takes up nearly the entire north wall. There's also a table against another wall{banana}. There's a door to the south.",
  "south": "loadRoom|Tutorial/north-access",
  "features": [
    {
      "slug": "computer",
      "look": "It's covered in blinking lights, gauges, switches, keyboards, and inputs. {button}\nHint: You can perform all sorts of actions in the game. If you need more guidance you can look at this \"note\" that I left here that will tell you exactly what you need to do to progress.",
      "use": {
        "": [
          "Please enter the system password or type \"cancel\"",
          {
            "cmd": "choice",
            "args": [
              "Invalid password. Please try again or type \"cancel\"",
              [
                "password123",
                "cancel"
              ],
              {
                "password123": [
                  "\"Access granted\". The glass case covering a red button flips open.",
                  "setFlag|CASEOPEN"
                ],
                "cancel": "You decide to call it quits for now."
              }
            ]
          }
        ]
      }
    },
    {
      "slug": "note",
      "look": "Theres a handwritten note taped to the computer console next to the button:\n]The \"Exit Door Clamp Control\" button will seal or unseal the main exit from the tutorial facility.\nTo use the button, you would type \"push button\".\n]The button is enclosed in a glass case that can only be opened by using the computer (\"use computer\")."
    },
    {
      "slug": "banana",
      "destroyedFlag": "TOOKBANANA",
      "notice": " with a solitary banana sitting on it",
      "look": "It's a yellow banana.",
      "take": [
        "addItem|TUTORIAL_BANANA",
        "setFlag|TOOKBANANA",
        "You take the banana from the table."
      ]
    },
    {
      "slug": "table",
      "look": "Yup. That's a table{banana}, alright."
    },
    {
      "slug": "chair",
      "look": "It doesn't look very comfortable",
      "sit": "You sit in the chair. It isn't very comfortable so you stand back up."
    },
    {
      "slug": "button",
      "notice": [
        {
          "cmd": "ifFlag",
          "args": [
            "CASEOPEN",
            "There is a button labeled \"Exit Door Clamp Control\".",
            "There is a button labeled \"Exit Door Clamp Control\" sealed inside glass case."
          ]
        }
      ],
      "look": [
        "It's a round, red button. There's a label above it: \"Exit Door Clamp Control\".",
        {
          "cmd": "ifFlag",
          "args": [
            "CASEOPEN",
            "The glass case around it is flipped open. You can push the button now.",
            "There is a glass case around it sealing it in. You won't be able to push the button until it's open."
          ]
        }
      ],
      "push|press": [
        {
          "cmd": "ifFlag",
          "args": [
            "CASEOPEN",
            [
              "You push the button.",
              "You hear mechanical whirring and then a loud clank from the south.",
              {
                "cmd": "ifFlag",
                "args": [
                  "G.TUT_EAST_UNLOCKED",
                  [
                    "Hint: You just re-sealed the east door in the starting room.",
                    "unsetFlag|G.TUT_EAST_UNLOCKED"
                  ],
                  [
                    "Hint: The east door in the starting room is now open! You're almost out!",
                    "setFlag|G.TUT_EAST_UNLOCKED"
                  ]
                ]
              }
            ],
            "You can't push the button. There's a glass case sealing it in!"
          ]
        }
      ]
    },
    {
      "slug": "case",
      "altSlugs": [
        "glass",
        "glass case"
      ],
      "look": [
        {
          "cmd": "ifFlag",
          "args": [
            "CASEOPEN",
            "The glass case is flipped up, allowing access to the button.",
            "The glass case is sealing in the button. You'll have to get it open first. Hint: Try \"open case\"."
          ]
        }
      ],
      "open": "There's no way to physically open it. You'll have to use the computer to open it. Hint: \"use computer\"!",
      "break|smash|shatter|destroy": "You smack it a good one but it doesn't break. This is some space-aged stuff!"
    }
  ]
}