{
  "name": "The Computer Room",
  "slug": "Tutorial/north",
  "description": "You're in a large, brightly lit room. A single, uncomfortable looking metal chair sits before a huge computer console that takes up nearly the entire north wall. There's a door to the south.",
  "south": [
    "loadRoom|Tutorial/center"
  ],
  "features": [
    {
      "slug": "computer",
      "look": [
        "It's covered in blinking lights, gauges, switches, keyboards, and inputs. {button}",
        "Hint: You can perform all sorts of actions in the game. If you need more guidance you can look at this \"note\" that I left here that will tell you exactly what you need to do to progress."
      ],
      "use": {
        "": [
          {
            "cmd": "ifHasItem",
            "args": [
              "TUTORIAL_PC_KEY",
              [
                "You pick a random keyboard and punch in the passkey. The glass case covering a red button flips open.",
                "setFlag|CASEOPEN"
              ],
              [
                "You pick a keyboard and start punching keys. It doesn't work. Looks like you'll need a passkey."
              ]
            ]
          }
        ],
        "TUTORIAL_PC_KEY": [
          "removeItem|TUTORIAL_PC_KEY",
          "You pick a random keyboard and punch in the passkey. The glass case covering a red button flips open.",
          "setFlag|CASEOPEN"
        ]
      }
    },
    {
      "slug": "note",
      "look": [
        "Theres a handwritten note taped to the computer console next to the button:",
        "]The \"Exit Door Clamp Control\" button will seal or unseal the main exit from the tutorial facility.\nTo use the button, you would type \"push button\"."
      ]
    },
    {
      "slug": "chair",
      "look": [
        "It doesn't look very comfortable"
      ],
      "sit": [
        "You sit in the chair. It isn't very comfortable so you stand back up."
      ]
    },
    {
      "slug": "button",
      "notice": [
        "There is a button labeled \"Exit Door Clamp Control\" with a glass case."
      ],
      "look": [
        "It's a round, red button. There's a label above it: \"Exit Door Clamp Control\".",
        {
          "cmd": "ifFlag",
          "args": [
            "CASEOPEN",
            [
              "The glass case around it is flipped open. You can push the button now."
            ],
            [
              "There is a glass case around it sealing it in. You won't be able to push the button until it's open."
            ]
          ]
        }
      ],
      "push": [
        {
          "cmd": "ifFlag",
          "args": [
            "CASEOPEN",
            [
              "You push the button.",
              "You hear mechanical whirring and then a loud clank from the south.",
              {
                "cmd": "ifFlag",
                "args": [
                  "G.TUT_EAST_UNLOCKED",
                  [
                    "unsetFlag|G.TUT_EAST_UNLOCKED"
                  ],
                  [
                    "setFlag|G.TUT_EAST_UNLOCKED"
                  ]
                ]
              }
            ],
            [
              "You can't push the button. There's a glass case sealing it in!"
            ]
          ]
        }
      ]
    },
    {
      "slug": "case",
      "altSlugs": [
        "glass"
      ],
      "look": [
        {
          "cmd": "ifFlag",
          "args": [
            "CASEOPEN",
            [
              "The glass case is flipped up, allowing access to the button."
            ],
            [
              "The glass case is sealing in the button. You'll have to use a passkey on the computer to open it."
            ]
          ]
        }
      ],
      "open": [
        "There's no way to physically open it. You'll have to use a passkey on the computer."
      ],
      "break": [
        "You smack it a good one but it doesn't break."
      ],
      "smash": [
        "You smack it a good one but it doesn't break."
      ]
    }
  ]
}