{
  "name": "A Rocky Cliff Peninsula, High Above the Ocean",
  "slug": "Coast/peninsula",
  "description": "You're standing at the end of a peninsula on a rocky trail, at least eighty feet above the ocean below and a couple hundred feet away from the coastline. Just ahead of you the trail ends at the edge of the cliff. A hundred feet beyond that, across the open air you see the lighthouse, built atop a column of rock that's as tall as the cliff you're on.",
  "north": "loadRoom|Coast/rocky-trail",
  "south": [
    {
      "cmd": "ifFlag",
      "args": [
        "BRIDGEREPAIRED",
        "loadRoom|Coast/lighthouse-exterior",
        "There's nothing but open air in that direction! It would be suicide!"
      ]
    }
  ],
  "incant": {
    "deisigh": [
      {
        "cmd": "ifFlag",
        "args": [
          "BRIDGEREPAIRED",
          [
            "You incant the Charm of Repairing but nothing happens."
          ],
          [
            "You incant the Charm of Repairing. The glimmering, spectral vision of a bridge grows more solid and a bridge made of light stretches across the chasm before you. It grows brighter and brighter until suddenly, with a flash, the light is gone and a new rope bridge spans all the way to the other side.",
            "setFlag|BRIDGEREPAIRED"
          ]
        ]
      }
    ]
  },
  "features": [
    {
      "slug": "ocean",
      "look": "callCommon|see_ocean|global-common"
    },
    {
      "slug": "lighthouse",
      "look": "It's a tall, white lighthouse. The light is still working."
    },
    {
      "slug": "posts",
      "altSlugs": ["post"],
      "roomDesc": [
        "ifFlagWrite|!BRIDGEREPAIRED|Two large, wooden posts are driven into the rocky surface here and there are frayed remains of thick rope tied to them. You can see the same across the chasm near the lighthouse."
      ],
      "look": [
        "ifFlagWrite|!BRIDGEREPAIRED|They're driven into the ground with ropes tied to them. They must have anchored a rope bridge at one point.",
        "ifFlagWrite|BRIDGEREPAIRED|They're driven into the ground, anchoring this side of the rope bridge."
      ]
    },
    {
      "slug": "glimmer",
      "destroyedFlag": "BRIDGEREPAIRED",
      "roomDesc": "There is a glimmer in the air causing the light to bend and shift. It spans all the way across the chasm.",
      "look": "As the glimmer bends the light, you can see part of a ghostly image, mostly transparent, of a rope bridge extending partially across the chasm ahead of you."
    },
    {
      "slug": "bridge",
      "altSlugs": ["rope bridge"],
      "destroyedFlag": "!BRIDGEREPAIRED",
      "roomDesc": "Two large posts are driven into the rocky surface near the edge of the cliff. A long rope bridge that looks basically brand new is anchored to it. The bridge is anchored in the same way across the chasm near the lighthouse.\nYou could travel south across the bridge to the lighthouse.",
      "look": "It's a sturdy-looking rope bridge that spans the entire chasm."
    },
    {
      "slug": "chasm",
      "look": [
        "The chasm is a hundred feet across from where you stand to the spire of rock with the lighthouse on it.",
        "ifFlagWrite|!BRIDGEREPAIRED|There's a glimmer in the air that spans the entire length of the chasm."
      ]
    }
  ]
}