{
  "name": "Forest Bridge, North Bank",
  "slug": "Forest/broken-bridge-north",
  "description": "You're standing on the north bank of a raging river that bisects a dense forest. The roaring of the river shatters the eerie silence. The river is at least 50 feet across.\nAn overgrown trail leads through the trees to the north.",
  "north": "loadRoom|Forest/forest-cave-entrance",
  "south": [
    {
      "cmd": "ifFlag",
      "args": [
        "G.FORESTBRIDGEREPAIRED",
        "loadRoom|Forest/broken-bridge",
        "The bridge is out and the river looks far too dangerous to cross. Still, if you really wanted to you could try to cross the river."
      ]
    }
  ],
  "incant": {
    "deisigh": [
      {
        "cmd": "ifFlag",
        "args": [
          "G.FORESTBRIDGEREPAIRED",
          [
            "You incant the Charm of Repairing but nothing happens."
          ],
          [
            "You incant the Charm of Repairing. The glimmering, spectral vision of a bridge grows more solid and a bridge made of light stretches across the raging river. It grows brighter and brighter until suddenly, with a flash, the light is gone and a new wooden bridge spans the breadth of the river.",
            "setFlag|G.FORESTBRIDGEREPAIRED"
          ]
        ]
      }
    ]
  },
  "features": [
    {
      "slug": "bridge",
      "roomDesc": [
        {
          "cmd": "ifFlag",
          "args": [
            "G.FORESTBRIDGEREPAIRED",
            [
              "A wooden bridge spans the length of the river to the other bank. It looks like it was just built."
            ],
            [
              "An ancient, rotting bridge sticks out over the river maybe 10 feet. There is a faint glimmer in the air beyond where the bridge has broken away."
            ]
          ]
        }
      ],
      "look": [
        {
          "cmd": "ifFlag",
          "args": [
            "G.FORESTBRIDGEREPAIRED",
            [
              "A wooden bridge spans the length of the river to the other bank. It looks like it was just built."
            ],
            [
              "The bridge is ancient and rotting. It sticks out over the river maybe 10 feet. There is a faint glimmer in the air beyond where the bridge falls away into nothingness."
            ]
          ]
        }
      ]
    },
    {
      "slug": "glimmer",
      "altSlugs": [
        "glimmering"
      ],
      "destroyedFlag": "G.FORESTBRIDGEREPAIRED",
      "look": [
        "The glimmering sparkles in the air, bending and shifting in the light. You can see the beginnings of a spectral, nearly transparent vision of a bridge that spans the river."
      ]
    },
    {
      "slug": "water",
      "look": "The water is a little murky."
    },
    {
      "slug": "river",
      "look": "The river is a little murky.",
      "cross": "callCommon|swim_death|Forest/broken-bridge"
    }
  ]
}