{
  "area": "Forest",
  "name": "River, South Bank",
  "slug": "brook-south",
  "description": "The sound of a river breaks the eerie silence. An old wooden bridge once spanned the river but has since mostly collapsed and washed away. Part of it still juts out from either bank of the river, casting shadows on the water beneath it.",
  "south": "Forest/west-clearing",
  "features": [
    {
      "slug": "bridge",
      "look": [
        "The bridge is ancient and rotting. It sticks out over the river maybe 10 feet. The water underneath the bridge is in shadows."
      ]
    },
    {
      "slug": "shadows",
      "look": [
        "In the shadows beneath the bridge you see a rusty metal rod sticking out of the river about 5 feet from shore.",
        "setFlag:SEEROD"
      ]
    },
    {
      "slug": "rod",
      "look": [
        "It's a cylindrical, rusty metal rod sticking out of the water about 5 feet from shore."
      ],
      "hidden": true,
      "targetFlag": "SEEROD",
      "take": [
        {
          "cmd": "ifLVar",
          "args": [
            "FISH_DISTRACTED",
            false,
            [
              "gameOver:You wade out into the river and grab the metal rod. You give it a tug but it's caught in the rocks. You start working it back and forth to free it when you feel a stabbing pain in leg. It's quickly followed by another and another and another. The murky water begins to roil as the river reddens with your blood. Gray, toothy fish begin leaping from the water in a feeding frenzy, taking chunks of your flesh before returning to the murky river. You flee back to the bank of the river but it's too late. Your head spins and you lose consciousness."
            ],
            [
              "addItem:rod",
              "You wade out into the river and grab the metal rod. You give it a tug but it's caught in the rocks. You work it back and forth until it's free and then make your way back to the bank.",
              "updateLook:shadows:The shadows beneath the bridge conceal no further secrets, as far as you can tell.",
              "destroyFeature:rod"
            ]
          ]
        }
      ]
    },
    {
      "slug": "water",
      "look": [
        "The water is a little murky. You can see dark shapes moving around in it."
      ]
    },
    {
      "slug": "river",
      "look": [
        "The river is a little murky. You can see dark shapes moving around in it."
      ]
    }
  ],
  "throwStone": [
    "setFlag:FISH_DISTRACTED",
    "removeItem:stone",
    "You throw the stone into the river. Dark shapes beneath the murky water quickly dart downstream to where the stone splashed.",
    "updateLook:water:The water is a little murky.",
    "updateLook:river:The river is a little murky."
  ]
}