{
  "name": "Outside a Log Cabin in the Forest",
  "coords": "Forest B6",
  "slug": "Forest/cabin-entrance",
  "description": "You're standing outside a fenced-in yard surrounding a crudely-built log cabin in a clearing in the dense forest. Whispy smoke rises from the cabin's chimney. There's a gate in the wooden fence which is currently open. Inside the fence is a small garden with {bucket} sitting next to it.\n{man}\nA well-worn trail leads to the east. To the west is the cabin.",
  "east": "loadRoom|Forest/well-worn-trail",
  "west": [
    {
      "cmd": "ifFlag",
      "args": [
        "ARDENINSIDE",
        "loadRoom|Forest/cabin-interior",
        [
          {
            "cmd": "ifFlag",
            "args": [
              "METARDEN",
              "Arden stops what he's doing and turns to you with a scowl and calls out. \"What do you think you're doing? You can't just enter my cabin without permission!\"",
              "The man stops what he's doing and turns to you with a scowl and calls out. \"What do you think you're doing? You can't just enter my cabin without permission!\""
            ]
          }
        ]
      ]
    }
  ],
  "features": [
    {
      "slug": "trail",
      "look": "It's a well-worn dirt trail. It must see frequent traffic since there's hardly any weeds or grass growing."
    },
    {
      "slug": "cabin",
      "look": "It's a crudely built log cabin. There's a door and some shuttered windows. It's got a chimney with whispy smoke rising from it."
    },
    {
      "slug": "gate",
      "look": "It's open."
    },
    {
      "slug": "man",
      "altSlugs": [
        "arden"
      ],
      "destroyedFlag": "ARDENINSIDE",
      "notice": [
        "ifFlagWrite|METARDEN|Arden's standing at the fence. It looks like he's trying to repair it.",
        "ifFlagWrite|!METARDEN|There's an older man standing at the fence. It looks like he's trying to repair it."
      ],
      "look": "He's an older man with graying hair and a crudely trimmed gray beard. He's wearing a ratty old brown jacket. With one hand he's holding a new board up to the fence and in the other he's holding a hammer. The new board is only attached to the fence on one end. He's grumbling to himself. \"How does this sort of thing always happen? One single nail short of finishing the job.\"",
      "ask": [
        {
          "cmd": "dialog",
          "args": {
            "": [
              {
                "cmd": "ifFlag",
                "args": [
                  "METARDEN",
                  "\"Sorry, newcomer. I don't have time for questions. I have to get this fence mended before nightfall. If I don't...\" He trails off, an apprehensive look on his face. He returns to what he was doing.",
                  "\"What's this? Don't they teach manners wherever it is you're from? It ain't proper to go on interrogating people without even greeting them first!\" He shakes his head while continuing his work."
                ]
              }
            ]
          }
        }
      ],
      "greet": [
        "The man turns toward you. \"Oh, hello there! The name's Arden. We haven't seen any new arrivals in a long, long time. Sorry, but I can't talk now, I have to finish mending this fence. You wouldn't happen to have any nails on you, would you?\"",
        "setFlag|METARDEN",
        {
          "cmd": "choice",
          "args": [
            "\"What's that? I asked if you have any nails on you. Do you?\"",
            [
              "yes",
              "no"
            ],
            {
              "yes": [
                {
                  "cmd": "ifHasItem",
                  "args": [
                    "NAIL",
                    "\"Oh, what an amazing coincidence that you happen to have exactly one nail on you. If you don't mind, please give it to me.\"",
                    "\"Now listen here, young'un! I've known many a man to carry a nail or few and I've even done it myself. I can tell quite plainly that you don't have any on you. I don't appreciate this kind of tomfoolery!\""
                  ]
                }
              ],
              "no": "\"Well that's a shame. If you find any, I'd really appreciate one.\""
            }
          ]
        }
      ],
      "give": {
        "NAIL": [
          "removeItem|NAIL",
          "setFlag|ARDENINSIDE",
          {
            "cmd": "ifFlag",
            "args": [
              "METARDEN",
              "\"Thank you so much. I really appreciate this!\"\nArden takes the nail, turns back to the fence and in just a few quick strikes finishes his repairs. He wipes the sweat from his brow and admires his work for a few moments. He turns back to you.",
              "\"Oh wow! How'd you know exactly what I needed? Huh. A complete stranger... doesn't even know my name and just gives me exactly what I needed most. What a coincidence! Really, thank you so much. I really appreciate this! The name's Arden, by the way.\"\nArden takes the nail, turns back to the fence and in just a few quick strikes finishes his repairs. He wipes the sweat from his brow and admires his work for a few moments. He turns back to you."
            ]
          },
          "\"Why don't you come inside and have a cup of tea?\" He gathers up his tools and heads into the cabin."
        ]
      }
    },
    {
      "slug": "bucket",
      "altSlugs": [
        "buckets",
        "pail",
        "pails"
      ],
      "notice": [
        {
          "cmd": "ifFlag",
          "args": [
            "G.TOOK_BUCKET",
            "a wet wooden bucket",
            "two wet wooden buckets"
          ]
        }
      ],
      "look": [
        {
          "cmd": "ifFlag",
          "args": [
            "G.TOOK_BUCKET",
            "It's just an ordinary wooden bucket with a handle. It's all wet. It must be used to water the garden.",
            "They're just ordinary wooden buckets with handles. They're all wet. They must be used to water the garden."
          ]
        }
      ]
    },
    {
      "slug": "garden",
      "look": "The garden is fairly large and has lots of different things growing in it. You can see carrots, cabbage, peas, tomatoes, and some others you don't recognize."
    },
    {
      "slug": "fence",
      "look": "It's a wooden fence. It completely surrounds the cabin, yard, and garden."
    }
  ]
}