{
  "name": "Cabin Interior",
  "coords": "Forest A6",
  "slug": "Forest/cabin-interior",
  "description": "You're in a cozy, one-room cabin. There are two beds, a small stone fireplace, a kitchen and a dining table with two chairs. A small array of pots and pans hangs on nails on the wall above the kitchen. The cabin's only door leads east, back out to the forest.",
  "east": [
    {
      "cmd": "ifFlag",
      "args": [
        "SITTING",
        "You're currently sitting at the table across from Arden. You'll have to stand before you can leave.",
        "loadRoom|Forest/cabin-entrance"
      ]
    }
  ],
  "stand": [
    {
      "cmd": "ifFlag",
      "args": [
        "SITTING",
        [
          "You stand up.",
          "unsetFlag|SITTING"
        ],
        "You're already standing!"
      ]
    }
  ],
  "_common": {
    "arden_applies_cure": [
      "removeItem|BLIGHT_CURE",
      "setFlag|EDRACURED",
      "You hand the cure to Arden and he takes it with great reverence. He kneels beside Edra's bed. With one hand he gently opens Edra's mouth and with the other he slowly pours the shimmering liquid down his throat. For a moment, nothing happens and the silence is overbearing. Then, suddenly, Edra sputters out a cough and gasps for air.",
      "Edra jolts awake and you make eye contact with him. He has the most brilliant blue eyes you've ever encountered, but they're wide with fear! He cries out \"ROHCNA!\" Both you and Arden are frozen in place! Your muscles refuse to work! The memory returns to you suddenly, as though you've always known it. You can now \"incant rohcna\", the Charm of Stillness!",
      "callCommon|after_learn_incant|global-common",
      "setFlag|G.ROHCNA",
      {
        "cmd": "waitForInput",
        "args": [
          "For a few moments, Edra gathers his wits and looks around in a panic. Then he sees you and his brother paralyzed. \"Oh! Arden!\" He mumbles arcane words and Arden begins moving again. \"Who's that?\" he asks Arden, barely able to croak out the words.",
          "\"Damn your sorcery, Edra! They're a friend!\" Arden groans.",
          "Edra focuses on you and mumbles more arcane phrases. You can feel your muscles loosen. You can move again!",
          "\"Edra, you're finally awake!\" Arden is ecstatic. He grabs Edra in a giant bear hug. Edra groans. \"I can't believe it. You're finally back!\" Arden is in tears. \"Edra?\" He releases his grip on his younger brother who is unconscious once again. Arden lays him back into his bed and covers him with his blanket. \"A little too much excitement all at once, eh brother?\" he asks while wiping away a tear. \"When you get your strength back, I'll be here waiting.\"",
          "Arden returns to his seat at the table and regards you. \"I can never thank you enough for curing Edra. You have my eternal gratitude. It's strange, though, I can't believe I could forget that Edra was a sorcerer. It's coming back to me now, slowly. I learned only recently. It was quite a shock, let me tell you! I think... I think there was a woman involved. Someone after my brother. Ahh, but I can't recall now.\"",
          "Arden smiles at you. \"But seriously, thank you. I only wish there was something I could do to repay you. You should come back sometime to see Edra when he's awake. I'm sure he'd like to meet his savior.\""
        ]
      }
    ]
  },
  "features": [
    {
      "slug": "arden",
      "roomDesc": [
        "ifFlagWrite|!SITTING|Arden sits in a chair at the table with two tin cups and a kettle. His jacket is hanging on the chair behind him. He's wearing an orange plaid shirt.\"Please, take a seat. Have some tea and let's talk.\"",
        "ifFlagWrite|SITTING|Arden sits in a chair across the table from you at the table with two tin cups and a kettle."
      ],
      "look": "Arden's an older man with graying hair and a crudely trimmed gray beard. He's sitting in a chair at the table holding a cup of tea, watching you, waiting patiently to answer any of your questions.",
      "greet": "\"Hi again. Have a seat and we can chat.\"",
      "ask": [
        {
          "cmd": "ifFlag",
          "args": [
            "SITTING",
            [
              {
                "cmd": "dialog",
                "args": {
                  "": "\"I don't know anything about that.\"",
                  "what's going on": "\"To put it plainly, I don't know. But here's what I do know.\" He takes a sip of his tea. \"We,\" he motions toward Edra, \"like you, don't remember anything before we woke up here on the island. Yes, we're on an island if you didn't know already. Except we didn't wake up here in the forest. And we didn't wake up together. No, I woke up on the beach south of here past the swamp. Edra, the poor bastard. I found him in the swamp covered in giant mosquito bites.\"\n\"We've met a few others like yourself but not in a long, long time. We're not sure how people are getting to the island at all, let alone why hardly anyone new comes along anymore.\"",
                  "others": [
                    "\"It's been a long time since we've met anyone new. You're the first person in... well... wow. I'm not really sure. A really long time. None of the others knew what was going on or had any memories from before waking up on the island. They all went off on their own trying to find a way off the island but I was never able to. I've got to stay here and look after Edra.\"",
                    {
                      "cmd": "ifFlag",
                      "args": [
                        "EDRACURED",
                        "",
                        "\"How about you? If you'd like to, you could stay here and help out. There's no need to run off and meet whatever fate befell the others. So what do you say, do you want to settle down and live here instead?\"",
                        {
                          "cmd": "choice",
                          "args": [
                            "Arden takes another sip of his tea and says \"I'm a simple man. Speak plainly. Do you want to give up exploring the island to settle down and live here instead? A simple yes or no will do.\"",
                            [
                              "yes",
                              "no"
                            ],
                            {
                              "yes": "gameOver|You decide that exploring the island would be too dangerous so you agree to Arden's offer. Over the coming months you and Arden build a small addition to the cabin which becomes your new room. You help tend the garden and fetch water from the well to the east but never venture any further. After a while, Arden passes away from old age. You dig him a grave in the backyard and visit it every day. You carry on, taking care of Edra for years. He never does wake up. Eventually, he passes away too. You live alone in the cabin for many years but no new arrivals ever show up.\nYou live a long, quiet life alone in your cabin in the woods. One night after you've grown to be quite elderly, you have a dream about exploring the island. It's equal parts adventurous, exciting, and scary. The dream is tinged with a feeling of what might have been.\nYou pass away peacefully in your sleep.",
                              "no": "\"I thought not. Nobody's ever taken the offer. I can only imagine what's happened to them.\""
                            }
                          ]
                        }
                      ]
                    }
                  ],
                  "edra": [
                    "\"He's my younger brother. I found the poor guy in the swamp south of here covered in giant mosquito bites. By the time we found each other he was nearly sucked dry. I managed to carry him out of the swamp and find this clearing in the forest. It was... real tough at first. Edra was asleep the whole time. Eventually I finished the cabin and we moved inside.\"",
                    {
                      "cmd": "ifFlag",
                      "args": [
                        "EDRACURED",
                        [
                          "\"And now, thanks to you, he's finally cured. I can't wait until he's up and about again! I can't wait to show him this safe little home I've built for us!\""
                        ],
                        [
                          "\"It's been... a long, long time since he's been awake. I've been taking care of him for years.\"",
                          "\"If only there was a cure for whatever he's afflicted with. But,\" he sighs, \"I can't go far. Plus, at least we're safe here.\""
                        ]
                      ]
                    },
                    "\"Hah, not that he was really ever concerned about safety. He was always the adventurous, risk-taking type.\" He smiles and continues. \"I remember he had this old hotrod and... wait. Is that right? Or was it...? Hm.\" He's quiet for a few moments. \"Sometimes, I feel like I can almost remember my life before I woke up on the island but then it just slips away. I always thought the memories would return with time but I don't think that's the case anymore.\""
                  ],
                  "island": "\"Yeah, we're definitely on an island. I woke up on a sandy beach beyond the swamp to the south. Couldn't see anything but ocean on the horizon. I heard from others a long time ago that they'd climbed part way up a mountain to the north and were able to see the whole island.\"\n\"Le'see, what'd they say? There's a black mountain to the north, ruins to the east, the swamp, of course, to the south with the beach beyond that. Apparently there's some way to reach the mountain through the ruins. Oh, and there was a lighthouse on cliff off the beach. I couldn't get to it, though. The bridge was out. Plus I had to find Edra.\"",
                  "lighthouse": "\"Yup. Damndest thing too. The light was still working. I couldn't reach it, though. The bridge was out. It's south of here, past the swamp and on a spire of stone off the beach.\"",
                  "swamp": "\"That's where I found Edra after I woke up on the island. There are loads of blood-sucking giant mosquitoes all over the place down there. They're easy enough to keep off of you but poor Edra was out cold and nearly got sucked dry. I remember seeing some kind of creepy hut in the swamp but it gave us a bad feeling so we avoided it.\"",
                  "hut": "\"The hut in the swamp, yeah. It was real creepy and gave me a bad feeling. I avoided it. What's that? Why? Because there were all these weird totems sticking up out of the muck with wicker and vine dreamcatcher-things hanging off them and weird lights coming from inside. Oh, and animal skulls, loads of animal skulls.\"",
                  "mosquito|giant mosquito": "\"Those suckers are all over the swamp south of here. They're easy enough to keep off of you... as long as you're paying attention.\"",
                  "cure": [
                    {
                      "cmd": "ifFlag",
                      "args": [
                        "EDRACURED",
                        "\"I'll never be able to repay your kindness. Thank you again for finding the cure.\"",
                        "\"Maybe one exists and maybe not. I'd guess that if there was one, you'd find what's necessary for it in the swamp. I can't go off looking for it, though. Not with Edra being in the state he is.\""
                      ]
                    }
                  ],
                  "cabin": "\"You like it? We built it years ago. Well, to be honest, it was just me. Edra was out cold after his ordeal in the swamp.\"",
                  "forest": "\"It's big and it's dense. I know there's a trail that leads north to a fork but I didn't explore much, not with Edra being sick and all. The trail from the cabin leads east to an old well that we found. I make the trek every day to draw water. Be careful over near the well, though.\"",
                  "well": "\"It's to the east. Have you been over there? Be real careful. I saw a giant hornet one time nearby. I think they've got a nest to the north.\"",
                  "hornet|giant hornet": "\"If you see one, run. Those things have stingers the size of swords!\"",
                  "escape": "\"Who knows if there's a way off the island. I've met others a long time ago that looked for one but I've never seen any of them again. Whether that means they found an escape or if they met an untimely end somewhere on the island, who knows?\"",
                  "mountain|black mountain": "\"There's a huge, black mountain far to the north. The others that I met a long time ago said that there was something up there. They didn't elaborate. I've actually seen the mountain myself. Years ago after we had finally got the cabin built, I decided to climb the tallest tree I could find to try to get the lay of the land. Couldn't see much except for the black mountain to the north. Gave me a real uneasy feeling looking at it though.\"",
                  "something|something up there": "\"Not sure. The others didn't say anything specific.\"",
                  "uneasy feeling|feeling|real uneasy feeling": "\"Yeah. It was a feeling of dread that was slowly building up while looking at the mountain. Almost like the mountain was looking back at me. I've never looked at it again.\"",
                  "ruins": "\"I heard they're somewhere northeast of here. I don't know much about them. I've never explored them.\"",
                  "beach": "\"It's to the south past the swamp. It was really nice, actually. It would be a nice place to vacation at if, you know, I wasn't worried for my life the last time I was there. It's where I first woke up on the island.\"",
                  "hotrod": "\"I think Edra had one. Maybe. Before...\" he motions all around, \"all of this.\"",
                  "nail": "\"Thanks again for that. I don't even remember how long I was standing there needing a single nail.\"",
                  "arden|past|his past": "\"I'm thirty five years old and--\" He strokes his gray beard for a moment. \"Well, I guess I'm not thirty five anymore. Let me start over.\" He clears his throat.\n\"I'm older than thirty five years old and have been living here with my younger brother Edra for a long time. I woke up on the beach south of the swamp alone and had to find Edra. Turns out he was in the swamp. Before all this, I was an accountant--er... I mean a math prof... Actually, I don't remember. I think I did something with numbers.\"",
                  "favorite color": "\"Do you ask all the strangers you meet in the woods this question?\" He smiles. \"Orange. I've always liked orange.\"",
                  "edra's favorite color": "\"Now why would you possibly want to know that? I think it was... It was--you know? I've actually forgotten.\"",
                  "ophelia": "\"Hmmm... The name rings a bell...\" He looks downward and starts tugging on his beard, lost in thought.\n\"Oh! Ophelia! Of course! How could I have forgotten? We met her in the forest when we first arrived. She said she was exploring the island trying to figure out what was going on. She stayed with us for a little while while we built the cabin.\"\nEven through his beard you can see he begins to blush a little. \"She was really pretty. Eventually she said she needed to explore the rest of the island and look for a way to escape. She came back a long time afterward with some others in tow. They said they were heading to the black mountain to find a way out.\" He frowns. \"I think we saw some of them again, once. They told us that they had encountered something up there on the mountain.\"",
                  "merek|stanley|rhode|meredith": "\"Sorry, I don't know anyone by that name.\""
                }
              }
            ],
            "Arden looks up at you from his seat. \"Please have a seat first. I don't like having to crane my neck.\""
          ]
        }
      ],
      "give": {
        "BLIGHT_CURE": [
          "Arden watches wide-eyed as you produce the vial of shimmering liquid. \"Is that...?\" He trails off. \"I can't believe it. Thank you. Let's fix him up!\"",
          "callCommon|arden_applies_cure"
        ]
      }
    },
    {
      "slug": "Edra",
      "altSlugs": [
        "man"
      ],
      "roomDesc": "There's another man in one of the beds, asleep under a wool blanket.",
      "look": [
        "He's a younger man, maybe in his mid-30s, with a crudely trimmed brown beard and hair. He's fast asleep in bed.",
        {
          "cmd": "ifFlag",
          "args": [
            "EDRACURED",
            "You can still remember his brilliant blue eyes. Arden sees you looking at him. \"Edra was awake and talking a little while ago. You just missed him.\"",
            "Arden sees you looking at him. \"That's my younger brother Edra. He's been asleep a long time.\""
          ]
        }
      ],
      "greet": [
        {
          "cmd": "ifFlag",
          "args": [
            "EDRACURED",
            "Edra mumbles something in his sleep and rolls over. \"He just needs his beauty sleep,\" Arden says with a chuckle.",
            "Edra doesn't respond. \"He's not much for talking nowadays,\" Arden says then chuckles to himself."
          ]
        }
      ],
      "give": {
        "": [
          {
            "cmd": "ifFlag",
            "args": [
              "EDRACURED",
              "Edra's asleep. And he probably doesn't want that anyway.",
              "Edra is in no condition to accept that."
            ]
          }
        ],
        "BLIGHT_CURE": [
          "Arden watches wide-eyed as you produce the vial of shimmering liquid. \"Is that...?\" He trails off. You uncork the vial and approach Edra. \"Wait,\" Arden interrupts you, \"Let me. He's my little brother.\"",
          "callCommon|arden_applies_cure"
        ]
      }
    },
    {
      "slug": "chair",
      "look": [
        "It's a crudely made, wooden chair. Arden sees you looking at it. \"Not very fancy, I know. But you make do with what you can make with your own two hands out here.\"",
        "ifFlagWrite|!SITTING|\"Take a seat and let's talk.\""
      ],
      "sit": [
        {
          "cmd": "ifFlag",
          "args": [
            "SITTING",
            "You're already sitting across from Arden at the table.",
            [
              "You take a seat across from Arden.",
              "setFlag|SITTING",
              "\"Please, have some tea. That there,\" Arden motions across the room at the man asleep in bed, \"is my brother Edra. We're pleased to meet you.\"",
              "\"Now I'm sure you've got lots of things you want to ask me about or maybe you just want to ask about %what's going on%. So shoot. I'll try to answer any questions you've got.\" He takes a sip from his tea."
            ]
          ]
        }
      ]
    },
    {
      "slug": "tea",
      "look": "\"Have some. I can't promise that it's particularly good but at least it's warm.\" He smiles and takes a sip of his tea.",
      "drink": [
        {
          "cmd": "ifVar",
          "args": [
            "SIPSTAKEN",
            "<",
            5,
            [
              "You take a sip of your tea.",
              "incVar|SIPSTAKEN",
              "incVar|TOTALSIPSTAKEN"
            ],
            [
              "You've run out of tea. Arden asks \"Would you like some more?\"",
              {
                "cmd": "choice",
                "args": [
                  "\"Did you want some more tea or not?\"",
                  [
                    "yes",
                    "no"
                  ],
                  {
                    "yes": [
                      {
                        "cmd": "ifVar",
                        "args": [
                          "TOTALSIPSTAKEN",
                          "<",
                          15,
                          [
                            "Arden takes the kettle and refills your cup.",
                            "decVar|SIPSTAKEN|5"
                          ],
                          [
                            "Arden takes the kettle and goes to refill your cup only to find it's empty. \"Sorry, seems we've run out.\""
                          ]
                        ]
                      }
                    ],
                    "no": [
                      "Arden just smiles at you."
                    ]
                  }
                ]
              }
            ]
          ]
        }
      ]
    },
    {
      "slug": "pots",
      "altSlugs": [
        "pans",
        "pots and pans",
        "pot",
        "pan"
      ],
      "look": "They're metal pots and pans. There aren't many of them, just the essentials. Arden says \"You like my fine dining establishment? I found those...\" He trails off for a moment then laughs. \"Well, it's been so long I actually don't remember.\""
    },
    {
      "slug": "fireplace",
      "look": "It's a basic fireplace made out of stones. There's a small fire burning in it and a stack of firewood beside it. Arden says \"You have no idea how hard it is to try to scavenge a bunch of rocks from a forest and build a fireplace by yourself.\""
    },
    {
      "slug": "kitchen",
      "look": "It's small and not very impressive. There are some pots and pans hanging on nails on the wall. There's also a wooden trough that Arden must use as a sink."
    },
    {
      "slug": "table",
      "look": "It's a hand-made wooden table. It's not level; One of the legs is slightly too short. There's a chunk of bark shimming it up. There are two cups and a kettle on it. Arden sits in one of the chairs. \"You like my fine craftsmanship?\" He smiles."
    },
    {
      "slug": "bed",
      "altSlugs": [
        "beds"
      ],
      "look": "There are two beds. Each has a gray wool blanket. One's currently empty and the other has a man sleeping in it. Arden tells you \"That's Edra, my younger brother\""
    }
  ]
}