{
  "name": "An Old Well in the Forest",
  "slug": "Forest/old-well",
  "description": "You're standing near an old well in the middle of a small clearing in the dense forest. It has a little roof and a crank{pail}.\nA well-worn trail leads to the west and a separate, overgrown path leads to the south. To the north, branches have been shorn clean off the trees, forming a path through the forest. You hear a cacophonous buzzing coming from the north.",
  "west": "loadRoom|Forest/well-worn-trail",
  "north": "loadRoom|Forest/hornet-nest",
  "south": "loadRoom|Forest/swamp-entrance",
  "features": [
    {
      "slug": "well",
      "look": "It's a brick well. It stands six-ish feet high."
    },
    {
      "slug": "pail",
      "notice": [
        {
          "cmd": "ifFlag",
          "args": [
            "PAILDOWN",
            null,
            " with a rope attached to a pail sitting on its edge"
          ]
        }
      ],
      "look": [
        {
          "cmd": "ifFlag",
          "args": [
            "PAILDOWN",
            "You can't see it. It's all the way down at the bottom of the well.",
            [
              "The pail's sitting on the edge of the well and is attached to the well via a rope.",
              {
                "cmd": "ifFlag",
                "args": [
                  "PAILHASWATER",
                  "It's full of crystal-clear water.",
                  "It's empty."
                ]
              }
            ]
          ]
        }
      ],
      "take": "You shouldn't take the pail. How would anyone else draw water?",
      "drop": [
        {
          "cmd": "ifFlag",
          "args": [
            "PAILDOWN",
            "You can't reach it. It's all the way down at the bottom of the well.",
            [
              "You grab the pail and drop it down into the well. It falls all the way to the bottom and you can hear a splash from down in the darkness.",
              "setFlag|PAILDOWN",
              "setFlag|PAILHASWATER"
            ]
          ]
        }
      ]
    },
    {
      "slug": "rope",
      "look": "It's very ropey."
    },
    {
      "slug": "crank",
      "look": "It's built into the side of the well's structure. When the pail's down in the well, the crank draws it back up to the surface.",
      "use": {
        "": [
          {
            "cmd": "ifFlag",
            "args": [
              "PAILDOWN",
              [
                "You turn the crank on the side of the well over and over. Eventually the pail returns to the surface. You grab it and set it on the edge of the well.",
                "unsetFlag|PAILDOWN"
              ],
              "There's no need. The pail's already on the edge of the well. You'd have to drop the pail first."
            ]
          }
        ]
      }
    },
    {
      "slug": "path",
      "look": "It's a dirt path, mostly overtaken by encroaching weeds. It hasn't seen traffic in a long time."
    },
    {
      "slug": "trail",
      "look": "It's a well-worn dirt trail. It must see frequent traffic since there's hardly any weeds or grass growing."
    }
  ]
}