{
  "name": "An Old Well in the Forest",
  "slug": "Forest/old-well",
  "description": "You're standing near an old well in the middle of a small clearing in the dense forest. It has a little roof and a crank{bucket}.\nA well-worn trail leads to the west whereas an overgrown path leads to the south. To the north you can see many broken branches that almost form a path. You hear a cacophonous buzzing coming from the north.",
  "west": "loadRoom|Forest/well-worn-trail",
  "north": "TODO!",
  "south": "TODO!",
  "features": [
    {
      "slug": "well",
      "look": "It's a brick well. It stands six-ish feet high."
    },
    {
      "slug": "bucket",
      "notice": [
        {
          "cmd": "ifFlag",
          "args": [
            "BUCKETDOWN",
            null,
            " with a rope attached to a bucket sitting on its edge"
          ]
        }
      ],
      "look": [
        {
          "cmd": "ifFlag",
          "args": [
            "BUCKETDOWN",
            "You can't see it. It's all the way down at the bottom of the well.",
            [
              "The bucket's sitting on the edge of the well and is attached to the well via a rope.",
              {
                "cmd": "ifFlag",
                "args": [
                  "BUCKETHASWATER",
                  "It's full of crystal-clear water.",
                  "It's empty."
                ]
              }
            ]
          ]
        }
      ],
      "take": "You shouldn't take the bucket. How would anyone else draw water?",
      "drop": [
        {
          "cmd": "ifFlag",
          "args": [
            "BUCKETDOWN",
            "You can't reach it. It's all the way down at the bottom of the well.",
            [
              "You grab the bucket and drop it down into the well. It falls all the way to the bottom and you can hear a splash from down in the darkness.",
              "setFlag|BUCKETDOWN",
              "setFlag|BUCKETHASWATER"
            ]
          ]
        }
      ]
    },
    {
      "slug": "rope",
      "look": "It's very ropey."
    },
    {
      "slug": "crank",
      "look": "It's built into the wide of the well's structure. When the bucket's down in the well, the crank draws it back up to the surface.",
      "use": {
        "": [
          {
            "cmd": "ifFlag",
            "args": [
              "BUCKETDOWN",
              [
                "You turn the crank on the side of the well over and over. Eventually the bucket returns to the surface. You grab it and set it on the edge of the well.",
                "unsetFlag|BUCKETDOWN"
              ],
              "There's no need. The bucket's already on the edge of the well. You'd have to drop the bucket first."
            ]
          }
        ]
      }
    }
  ]
}